package com.lesson02;

/**
 * Создать метод принимающий на вход две переменные типа int.
 * Метод вычисляет их сумму и возвращает значение.
 * Вызвать этот метод из метода main. (Задание с урока)
 */

public class Part5 {
    public static void main(String[] args) {
        int a = 5;
        int b = 37;
        int c = a + b;
        System.out.println(c);
    }
}
