package com.lesson16;

/**
 * Создать класс Student, содержащий следующие характеристики – имя, группа, курс, оценки по предметам.
 * Создать коллекцию, содержащую объекты класса Student.
 * Перебрать всех студентов, вычислить средний балл каждого студента.
 * Если средний балл >=3, студент переводится на следующий курс, иначе отчисляется.
 * Напишите метод printStudents(List students, int course), который получает список студентов и номер курса
 * и печатает на консоль имена тех студентов из списка, которые обучаются на данном курсе.
 * Для обхода списка в этом методе используйте итератор.
 */

public class Part10 {
}
