package com.lesson2;

/**
 * Создать программу, в которой используются одно-строчные и много-строчные комментарии.
 */

public class Part3 {
    public static void main(String[] args) {
        System.out.println("Hello Everyone!"); //Задание с комментариями
    }
}

/**
 * Программа выводит
 * на экран
 * "Hello Everyone!"
 */
