package com.lesson15;

/**
 * а) Создать обобщенный класс с тремя параметрами (T, V, K).
 * Класс содержит три переменные типа (T, V, K), конструктор, принимающий на вход параметры типа (T, V, K),
 * методы возвращающие значения трех переменных.
 * Создать метод, выводящий на консоль имена классов для трех переменных класса.
 * б) Наложить ограничения на параметры типа: T должен реализовать интерфейс Comparable,
 * V должен реализовать интерфейс Serializable и расширять класс Animal,
 * K должен расширять класс Number. (Задание с урока)
 */

public class Part1 {
}
