package com.lesson05;

/**
 * Создать массив типа double с размером 4. Записать в него любые значения с помощью блока для инициализации.
 * Вывести на консоль значение первого элемента. (Задание с урока).
 */

public class Part11 {
    public static void main(String[] args) {
        double[] array = {4.5, 5, 6, 8.1};
        System.out.println(array[0]);
    }
}
